Tekla.Structures.Datatype.Angle
Provides support for angles using either the current Tekla Structures units, or user defined units

Tekla.Structures.Datatype.Angle.ToRadiansMultiplier
The constant to obtain radians from a value in degrees

Tekla.Structures.Datatype.Angle.ToDegreesMultiplier
The constant to obtain degrees from a value in radians

Tekla.Structures.Datatype.Angle.#ctor(System.Double)
Constructs an angle instance with an angle in degrees
degrees: Angle value in degrees.

Tekla.Structures.Datatype.Angle.CurrentUnitType
Gets or sets the Tekla Structures current angle type

Tekla.Structures.Datatype.Angle.DecimalPlaces
Gets the number of decimal places used for angles.

Tekla.Structures.Datatype.Angle.Degrees
Gets the angle value in degrees

Tekla.Structures.Datatype.Angle.Radians
Gets the angle value in radians

Tekla.Structures.Datatype.Angle.CurrentUnitValue
Gets the value of the angle in the current unit

Tekla.Structures.Datatype.Angle.FromDegrees(System.Double)
Creates an angle from a value in degrees
degrees: The angle in degrees
Returns: An Angle object representing the given angle

Tekla.Structures.Datatype.Angle.FromRadians(System.Double)
Creates an angle from a value in radians
radians: The angle in radians
Returns: An Angle object representing the given angle

Tekla.Structures.Datatype.Angle.FromCurrentUnit(System.Double)
Creates an angle given in the current unit type
angle: Angle given in the current unit type
Returns: An Angle object representing the given angle

Tekla.Structures.Datatype.Angle.Parse(System.String)
Parses the given text as an angle in the current unit type
text: Text to parse
Returns: Resulting angle from the text

Tekla.Structures.Datatype.Angle.Parse(System.String,System.IFormatProvider)
Parses the given text as an angle in the current unit type
text: Text to parse
formatProvider: Format provider
Returns: Resulting angle from the text

Tekla.Structures.Datatype.Angle.Parse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle.UnitType)
Parses the given text as an angle in the current unit type
text: Text to parse
formatProvider: Format provider
unitType: Input unit type
Returns: Resulting angle from the text

Tekla.Structures.Datatype.Angle.TryParse(System.String,Tekla.Structures.Datatype.Angle@)
Parses the given text as an angle in the current unit type
text: Text to parse
result: Resulting angle if success
Returns: True if the conversion succeeds, false otherwise

Tekla.Structures.Datatype.Angle.TryParse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle@)
Parses the given text as an angle in the current unit type
text: Text to parse
formatProvider: Format provider
result: Resulting angle if success
Returns: True if the conversion succeeds, false otherwise

Tekla.Structures.Datatype.Angle.TryParse(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle.UnitType,Tekla.Structures.Datatype.Angle@)
Parses the given text as an angle in the current unit type
text: Text to parse
formatProvider: Format provider
unitType: Input unit type
result: Resulting angle if success
Returns: True if the conversion succeeds, false otherwise

Tekla.Structures.Datatype.Angle.ToString
Converts the represented angle to a string in the current units
Returns: This angle as a string

Tekla.Structures.Datatype.Angle.ToString(Tekla.Structures.Datatype.Angle.UnitType)
Converts the represented angle to a string in the given units
unitType: Input unit type
Returns: This angle as a string

Tekla.Structures.Datatype.Angle.ToString(System.String,System.IFormatProvider)
Converts the represented angle to a string with the given parameters
format: The format string. Can be null.
formatProvider: The number format provider.
Returns: This angle as a string

Tekla.Structures.Datatype.Angle.ToString(System.String,System.IFormatProvider,Tekla.Structures.Datatype.Angle.UnitType)
Converts the represented angle to a string with the given parameters
format: The format string. Can be null.
formatProvider: The number format provider.
angleUnit: The unit type.
Returns: This angle as a string

Tekla.Structures.Datatype.Angle.CompareTo(Tekla.Structures.Datatype.Angle)
Compares this angle with another angle
other: Angle to compare to
Returns: Greater than zero if this angle is greater than other, otherwise less than zero
if this angle is less than other, otherwise 0 if they are equal

Tekla.Structures.Datatype.Angle.Equals(Tekla.Structures.Datatype.Angle)
Checks for approximate angle equality
other: Angle to compare to
Returns: True if the angles are the same, false otherwise